
mailer = require("nodemailer");

exports.smtpTransport = mailer.createTransport("SMTP",{
    service: "Gmail",
    auth: {
        user: "tripperarrangeyourttip@gmail.com",
        pass: "tripper1234"
    }
});
// email contex of unregisterd usrers
welcomeMailNotRegisterd = {
    from: "tripper support <tripperarrangeyourttip@gmail.com>",
    to: "",
    subject: "tripper תכנן את הטיול שלך",
    text: "שותף איתך טיול אך אתה לא רשום לשירות",
    html: "ברוך הבא למנוע חיפוש הטיולים tripper ותודה על הצטרפותך. <br> מערכת tripper מציע מנגנון לאיתור טיולים לכל מקום, לכל זמן, ועם כל אחד. <br> בהצטרפותך למאגר הרשומים תוכל לערוך טיול שהעלאת, לסמן ולצפות בטיולים שהתעניינת בהם.לערוך ולשתף טיולים ארוכים כקצרים עם חברים. <br> באופציית המסלול שלי תוכל לתכנן טיול קצר או של כמה ימים, להזמין חברים ולשתף אותם בתוכנית.חברייך ואתה תוכלו לערוך את המסלול ולהגיע לאופטימיזציה שלו. <br> באופציית המועדפים שלי תמצא טיולים שסימנת בעבר שמעניינים אותך, פה תוכל גם לערוך אותם מחדש. <br> באופציית החשבון שלי תוכל למצוא את טיולים שכתבת והעלאת, בנוסף, טיולים שהגדרת כפרטיים יוצגו כאן. <br> במקרה ותחליט לשתף את הטיול הפרטי עם חברייך טיול זה יוצג להם בתוצאות החיפוש.על מנת להיות שותף פעיל ולתרום למאגר תוכל באופצייתהוסף טיול לכתוב טיול משלך בצירוף תמונות. <br> מקווים שתהנה, צוות tripper  תודה <br>  נכתב בלשון זכר למען הנוחות אך מכוון לשני המינים"
   
}
// email contex of new user
welcomeMail = {
    from: "tripper support <tripperarrangeyourttip@gmail.com>",
    to: "",
    subject: "tripper תכנן את הטיול שלך",
    text: "תודה שנרשמת לtripper אשר עוזר לך לתכנן את הטיול שלך",
    html: "ברוך הבא למנוע חיפוש הטיולים tripper ותודה על הצטרפותך. <br> מערכת tripper מציע מנגנון לאיתור טיולים לכל מקום, לכל זמן, ועם כל אחד. <br> בהצטרפותך למאגר הרשומים תוכל לערוך טיול שהעלאת, לסמן ולצפות בטיולים שהתעניינת בהם. <br> לערוך ולשתף טיולים ארוכים כקצרים עם חברים. <br> באופציית המסלול שלי תוכל לתכנן טיול קצר או של כמה ימים, להזמין חברים ולשתף אותם בתוכנית. <br> חברייך ואתה תוכלו לערוך את המסלול ולהגיע לאופטימיזציה שלו. <br> באופציית המועדפים שלי תמצא טיולים שסימנת בעבר שמעניינים אותך, פה תוכל גם לערוך אותם מחדש. <br> באופציית החשבון שלי תוכל למצוא את טיולים שכתבת והעלאת, בנוסף, טיולים שהגדרת כפרטיים יוצגו כאן. <br> במקרה ותחליט לשתף את הטיול הפרטי עם חברייך טיול זה יוצג להם בתוצאות החיפוש. <br> על מנת להיות שותף פעיל ולתרום למאגר תוכל באופציית הוסף טיול לכתוב טיול משלך בצירוף תמונות. <br> מקווים שתהנה, צוות tripper תודה  <br> נכתב בלשון זכר למען הנוחות אך מכוון לשני המינים"
}
// email contex of changes in user schedule
shareMail = {
    from: "tripper support <tripperarrangeyourttip@gmail.com>",
    to: "",
    subject: "tripper זיהה ששותף איתך טיול",
    text: "זיהינו שבוצעו שינויים במסלול שלך...",
    html: "חברך הזמין אותך לצפות במסלול שעניין אותו. <br> לאחר שתכנס לקטגורית המסלול שלי תוכל לצפות במסלול, להוסיף עוד יעדים או להוריד יעדים. <br> בפעולה אינטרקטיבית תוכלו להגיע למסלול המותאם בשבילכם. <br> מקווים שתהנה, צוות tripper ,תודה  <br> נכתב בלשון זכר למען הנוחות אך מכוון לשני המינים"
}